src/Catalogs/Scan_ПакетыСервисныхОпераций/Scan_ПакетыСервисныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ПакетыСервисныхОпераций</name>
  <comment>Пакеты сервисных операций, выполняемых при контроле технического состояния</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокКТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СервисныеОперацииПакета</name>
    <attributes>
      <name>СервиснаяОперацияПакета</name>
      <type>
        <types>CatalogRef.Scan_СервисныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ЧекЛистТехническогоСостоянияИзделия/Scan_ЧекЛистТехническогоСостоянияИзделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЧекЛистТехническогоСостоянияИзделия</name>
  <comment>Чек лист технического состояния продукта (scania)</comment>
  <registerRecords>InformationRegister.Scan_РеестрОказанныхУслуг</registerRecords>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСИсполнителем</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыполненияКТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаВыполненияКТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КТСВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОказаннаяУслуга</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимостьУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокКТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>EnumRef.Scan_ПричиныНевыполненияКТС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРабот</name>
    <attributes>
      <name>Работы</name>
      <type>
        <types>CatalogRef.Scan_СервисныеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Составляющая</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеСервисныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБыло</name>
      <type>
        <types>CatalogRef.Scan_ЕмкостиАКБ</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСтало</name>
      <type>
        <types>CatalogRef.Scan_ЕмкостиАКБ</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Scan_ПакетыСервисныхОпераций/ManagerModule.bsl
//rarus FominskiyAS 12.08.2019  mantis 14760 +++

// Формирует печатные формы
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,"СервисныеОперацииПриКТС", НСтр("ru = 'Сервисные операции при КТС'"),
				ПечатьПФ_MXL_СервисныеОперацииПриКТС(ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьПФ_MXL_СервисныеОперацииПриКТС(ПараметрыПодготовкиПечатнойФормы) Экспорт
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.КлючПараметровПечати = "ПФ_MXL_СервисныеОперацииПриКТС";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Scan_ЧекЛистТехническогоСостоянияИзделия.ПФ_MXL_СервисныеОперацииПриКТС");
	
	Для Каждого Элемент из ПараметрыПодготовкиПечатнойФормы.МассивОбъектов цикл 
	Документ = Элемент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаПервая = Макет.ПолучитьОбласть("СтрокаПервая");
	ОбластьСтрокаВложенная = Макет.ПолучитьОбласть("СтрокаВложенная");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	//Заполним шапку
	
	ОбластьШапка.Параметры.КоличествоДней = НРег(ЧислоПрописью(Документ.СрокКТС,,"день,дня,дней,м,,,,,0"));
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Заполним строки
	
	НомерСтроки = 1;
	НомерВложеннойСтроки = 1;
	//МассивБукв = ПолучитьМассивБукв();
	
	СтараяПерваяСтрока = Неопределено;
	ВерхняяСтрокаДерева = Неопределено;
	Для Каждого ТекСтрокаОбъекта Из Документ.СервисныеОперацииПакета Цикл
		ОбластьСтрокаПервая.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрокаПервая.Параметры.Работы = ТекСтрокаОбъекта.СервиснаяОперацияПакета;			
		НомерСтроки = НомерСтроки + 1;
		ТабличныйДокумент.Вывести(ОбластьСтрокаПервая);
		СоставляющиеСервисныхОпераций(ТекСтрокаОбъекта.СервиснаяОперацияПакета,ОбластьСтрокаВложенная,ТабличныйДокумент);
	КонецЦикла; 	
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура СоставляющиеСервисныхОпераций(СервиснаяОперацияПакета,ОбластьСтрокаВложенная,ТабличныйДокумент)
	
	МассивБукв = ПолучитьМассивБукв();
	НомерВложеннойСтроки = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоставляющиеСервисныхОпераций.Ссылка КАК Ссылка,
		|	Scan_СоставляющиеСервисныхОпераций.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Scan_СоставляющиеСервисныхОпераций КАК Scan_СоставляющиеСервисныхОпераций
		|ГДЕ
		|	Scan_СоставляющиеСервисныхОпераций.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", СервиснаяОперацияПакета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрокаВложенная.Параметры.НомерСтроки = МассивБукв[НомерВложеннойСтроки];
		ОбластьСтрокаВложенная.Параметры.Составляющая = ВыборкаДетальныеЗаписи.Наименование;			
		НомерВложеннойСтроки = НомерВложеннойСтроки + 1;
		ТабличныйДокумент.Вывести(ОбластьСтрокаВложенная);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивБукв() Экспорт
	МассивБукв = Новый Массив;
	
	МассивБукв.Добавить("0");
	МассивБукв.Добавить("а");
	МассивБукв.Добавить("б");
	МассивБукв.Добавить("в");
	МассивБукв.Добавить("г");
	МассивБукв.Добавить("д"); 	
	МассивБукв.Добавить("е");
	МассивБукв.Добавить("ж");
	МассивБукв.Добавить("з");
	МассивБукв.Добавить("и");
	МассивБукв.Добавить("к");
	МассивБукв.Добавить("л");
	МассивБукв.Добавить("м");
	МассивБукв.Добавить("н");
	МассивБукв.Добавить("о"); 	
	МассивБукв.Добавить("п");
	МассивБукв.Добавить("р");
	МассивБукв.Добавить("с");
	МассивБукв.Добавить("т");
	МассивБукв.Добавить("у");
	МассивБукв.Добавить("ф");
	МассивБукв.Добавить("х");
	МассивБукв.Добавить("ц");
	МассивБукв.Добавить("ч");
	МассивБукв.Добавить("ш");
	МассивБукв.Добавить("э"); 
	МассивБукв.Добавить("ю"); 
	МассивБукв.Добавить("я");
	
	Возврат МассивБукв;
КонецФункции

//rarus FominskiyAS 12.08.2019  mantis 14760 ---
